[
    {
        "name": "Pikachu",
        "img": "https://img.pokemondb.net/sprites/home/normal/2x/avif/pikachu.avif",
        "level": 34,
        "description": "Pikachu, an Electric-type Pokémon, captivates with its yellow fur, expressive features, and the ability to generate electrifying energy in its rosy cheeks, adding a spark of charm to the Pokémon universe."
    },
    {
        "name": "Geodude",
        "img" : "https://img.pokemondb.net/sprites/home/normal/2x/avif/geodude.avif",
        "level": 45,
        "description": "Geodude is a rugged Rock/Ground-type Pokémon characterized by its rocky exterior and sturdy demeanor, embodying resilience in the Pokémon world."
    },
    {
        "name": "Mewtwo",
        "level": 28,
        "img":"https://img.pokemondb.net/sprites/home/normal/2x/avif/mewtwo.avif",
        "description": "Mewtwo, a powerful Psychic-type Pokémon, exudes an aura of mysterious strength with its sleek, genetically enhanced form and formidable psychic abilities in the Pokémon universe."
    },
    {
        "name": "Bulbasaur",
        "img": "https://img.pokemondb.net/sprites/home/normal/2x/avif/bulbasaur.avif",
        "level": 12,
        "description": "Bulbasaur, a Grass/Poison-type Pokémon, captivates with its bulb-topped back, showcasing the promise of blossoming into a formidable Ivysaur and later, a majestic Venusaur."
    },
    {
        "name": "Squirtle",
        "img" : "https://img.pokemondb.net/sprites/home/normal/2x/avif/squirtle.avif",
        "level": 54,
        "description": "Squirtle, the Water-type Pokémon, charms with its playful demeanor and water-spraying abilities, making it an endearing choice for trainers venturing into the Pokémon world."
    },
    {
        "name": "Charmander",
        "img" : "https://img.pokemondb.net/sprites/home/normal/2x/avif/charmander.avif",
        "level": 28,
        "description": "Charmander, a Fire-type Pokémon, captivates trainers with its flame-tipped tail, symbolizing its potential to evolve into the majestic Charmeleon and eventually the fiery dragon Charizard."
    },
    {
        "name": "Eevee",
        "img": "https://img.pokemondb.net/sprites/home/normal/2x/avif/eevee.avif",
        "level": 32,
        "description": "Eevee, the adorable Normal-type Pokémon, stands out for its versatility, as it can evolve into various forms, offering trainers a plethora of evolutionary possibilities in their Pokémon journey."
    }
]